[
  {
    "Name": "Abu Simbel Temples",
    "Description": "The Abu Simbel Temples were built by Pharaoh Ramses II in the 13th century BC to honor the gods and celebrate his power. The site consists of two temples: the Great Temple of Ramses II and the Small Temple of Nefertari, both carved into a mountainside near the Nile River in southern Egypt.The temples were built to impress Egypt’s enemies and strengthen Ramses II’s divine status. The Great Temple is dedicated to the gods Amun, Ra-Horakhty, and Ptah, as well as Ramses himself. The Small Temple is dedicated to Queen Nefertari and the goddess Hathor.One of the most fascinating aspects of Abu Simbel is the solar alignment phenomenon. Twice a year, on February 22 and October 22, the rising sun shines directly into the temple, illuminating statues of Ramses II and the gods, leaving only Ptah, the god of the underworld, in darkness.In the 1960s, the temples faced destruction due to the construction of the Aswan High Dam, which created Lake Nasser. A massive project, led by UNESCO, carefully cut and relocated the temples piece by piece to higher ground. This incredible effort preserved one of Egypt’s greatest monuments. Today, Abu Simbel stands as a symbol of Ramses II’s legacy and the brilliance of ancient Egyptian engineering.",
    "PictureUrl": "Images\\AncientSiteImage\\AbuSimple2.jpg",
    "VoiceUrl": "audios\\Abu Simbel Temples.mp3",
    "Adddress": "https://is.gd/AbuSimple",
    "OpeningTime": "7:00 AM",
    "ClosedTime": "4:00 PM"
  },
  {
    "Name": "Edfu Temple",
    "Description": "The Temple of Edfu was built during the Ptolemaic period (237–57 BC) and is one of the best-preserved temples in Egypt. It is dedicated to Horus, the falcon-headed god, who was believed to have fought Seth, the god of chaos, at this site.The temple follows the classic Egyptian temple design, with a huge entrance pylon decorated with scenes of the pharaoh defeating enemies. Inside, there is an open courtyard, a hypostyle hall with tall columns, and the sanctuary, where the sacred statue of Horus once stood. Statues of Horus as a falcon guard the entrance, adding to its grandeur.The walls of the temple are covered in detailed carvings that tell stories of religious rituals, festivals, and the battle between Horus and Seth. These inscriptions provide important historical and mythological knowledge.During the Roman period, the temple was abandoned and later buried under sand and mud, which helped preserve it. Rediscovered in the 19th century, the Temple of Edfu is now a major tourist attraction, offering a glimpse into ancient Egyptian beliefs and temple life.",
    "PictureUrl": "Images\\AncientSiteImage\\Edfu.jpg",
    "VoiceUrl": "audios\\Temple of Edfu.mp3",
    "Adddress": "https://is.gd/EdfuTemple",
    "OpeningTime": "7:00 AM",
    "ClosedTime": "5:00 PM"
  },
  {
    "Name": "Temple of Nefertari",
    "Description": "Around 1250 BC, Pharaoh Ramses II built the Temple of Nefertari at Abu Simbel to honor his wife, Queen Nefertari, and the goddess Hathor. It was rare for a queen to have a temple of her own, showing how much Ramses valued her. The temple was carved into a sandstone cliff, next to the Great Temple of Ramses II.The front of the temple has six giant statues, four of Ramses II and two of Nefertari, each about 10 meters tall. This was unique because queens were usually shown smaller than kings, but here, Nefertari is the same size as Ramses. Inside, the temple has pillars decorated with images of Hathor, the goddess of love and beauty, with scenes of Nefertari making offerings to the gods.The temple was designed for religious ceremonies and to honor the queen as a goddess. Over time, it was buried under sand until it was rediscovered in the 19th century. In the 1960s, the temple was moved stone by stone to higher ground to save it from flooding caused by the Aswan High Dam.Today, the Temple of Nefertari still stands as a symbol of love, power, and devotion, showing the deep bond between Ramses II and his queen.",
    "PictureUrl": "Images\\AncientSiteImage\\Nefertari.jpg",
    "VoiceUrl": "audios\\Temple of Nefertari.mp3",
    "Adddress": "https://is.gd/NefertariTemple",
    "OpeningTime": "6:30 AM",
    "ClosedTime": "4:00 PM"
  },
  {
    "Name": "The Great Pyramid of Giza : Khufu",
    "Description": "Around 2600 BC, Pharaoh Khufu wanted a grand tomb that would last forever. He ordered the construction of a massive pyramid at Giza, designed to be the largest and most impressive ever built. It was made of limestone blocks, each weighing several tons, and originally stood 146 meters tall, making it the tallest structure in the world for thousands of years.The pyramid was carefully designed with hidden chambers and passageways to protect the pharaoh’s body and treasures. Inside, the King’s Chamber, made of red granite, held Khufu’s sarcophagus. Below it, the Queen’s Chamber and an unfinished underground chamber were also built, though their purpose remains a mystery.Building the pyramid was a huge task. Thousands of workers, including skilled builders and laborers, worked for years, using ramps and tools to lift the heavy stones into place. The structure was so precise that its sides are almost perfectly aligned with the cardinal directions.The Great Pyramid is the last surviving Wonder of the Ancient World and remains one of the most fascinating monuments in history. It shows the incredible skill of ancient Egyptian builders and continues to amaze visitors from around the world.",
    "PictureUrl": "Images\\AncientSiteImage\\Khufu.jpg",
    "VoiceUrl": "audios\\Khufu Pyramid.mp3",
    "Adddress": "https://is.gd/PyrmidsOfGiza",
    "OpeningTime": "6:00 AM",
    "ClosedTime": "4:00 PM"
  },
  {
    "Name": "Pyramid of Khafre",
    "Description": "Around 2500 BC, Pharaoh Khafre built his pyramid at Giza, next to his father Khufu’s Great Pyramid. It was designed to be a grand tomb, slightly smaller than Khufu’s but appearing taller due to its higher position on the plateau. Originally, it stood 143 meters tall and was covered in smooth white limestone, with some of this casing still visible at the top today.Inside, the pyramid has a simple design compared to Khufu’s. A descending passage leads to the burial chamber, which was carved into the bedrock and lined with granite. The entrance was placed higher up on the pyramid’s face, a feature later seen in other pyramids.Khafre’s pyramid complex included a mortuary temple and a causeway leading to the Valley Temple, where rituals were performed. Near the complex stands the Great Sphinx, a massive limestone statue with a lion’s body and a human head, believed to represent Khafre himself as a protector of his tomb.Khafre’s pyramid remains one of the best-preserved pyramids of Egypt, showcasing the power and architectural skill of the Old Kingdom. Today, it stands as a symbol of ancient Egyptian greatness.",
    "PictureUrl": "Images\\AncientSiteImage\\Khafra.jpg",
    "VoiceUrl": "audios\\Khafre Pyramid.mp3",
    "Adddress": "https://is.gd/PyrmidsOfGiza",
    "OpeningTime": "6:00 AM",
    "ClosedTime": "4:00 PM"
  },
  {
    "Name": "Pyramid of Menkaure",
    "Description": "Around 2490 BC, Pharaoh Menkaure built his pyramid at Giza, next to the larger pyramids of his father, Khafre, and grandfather, Khufu. Though much smaller, originally standing 65 meters tall, it was unique because its lower sections were covered in red granite, making it different from the limestone pyramids of earlier kings.Inside, the pyramid has a simple design with several chambers, including a burial chamber lined with granite. Archaeologists discovered a beautifully carved sarcophagus, but it was lost at sea while being transported to England in the 19th century.Menkaure’s pyramid complex included three small pyramids, likely for his queens, and a mortuary temple. A long causeway connected it to the Valley Temple, where statues of the pharaoh were found, showing him alongside gods, emphasizing his divine connection.Despite its smaller size, Menkaure’s pyramid represents a shift in focus toward art and religious symbolism rather than just size. Today, it remains an important part of the Giza pyramid complex, showcasing the grandeur and craftsmanship of ancient Egypt.",
    "PictureUrl": "Images\\AncientSiteImage\\MenkaureFull.jpg",
    "VoiceUrl": "audios\\Menkaure Pyramid.mp3",
    "Adddress": "https://is.gd/PyrmidsOfGiza",
    "OpeningTime": "6:00 AM",
    "ClosedTime": "4:00 PM"
  },
  {
    "Name": "Step Pyramid of Djoser",
    "Description": "Around 2650 BC, Pharaoh Zoser wanted a special tomb for himself. He asked his chief architect, Imhotep, to design something new and grand. At that time, royal tombs were simple rectangular structures called mastabas, made of mudbrick. But Imhotep had a bold idea—he stacked six mastabas on top of each other and built them from stone instead of mudbrick. This became the Step Pyramid, the first stone pyramid in history and the beginning of Egypt’s great pyramids.The Step Pyramid is 60 meters high and surrounded by a large stone wall. Inside, there are temples, open yards, and small shrines for religious ceremonies. One important area, the Jubilee Court, was used for the Heb-Sed festival, where Pharaoh Zoser showed he was still strong enough to rule.Under the pyramid, there are many tunnels and rooms, stretching 6 kilometers. In the center is Zoser’s burial chamber, made of granite and decorated with blue tiles and carvings of his achievements. These tunnels were built to keep his tomb and treasures safe.The Step Pyramid was a great achievement in Egyptian architecture. It showed that Egyptians could build with stone and paved the way for the later, larger pyramids. Imhotep’s innovative design was so impressive that he was later worshiped as a god of wisdom and architecture. Today, the pyramid still stands as a symbol of Egypt’s rich history and engineering skills.",
    "PictureUrl": "Images\\AncientSiteImage\\djsor.jpg",
    "VoiceUrl": "audios\\Step Pyramid of Djoser.mp3",
    "Adddress": "https://is.gd/StepPyramidOfDjoser",
    "OpeningTime": "8:00 AM",
    "ClosedTime": "4:30 PM"
  },
  {
    "Name": "Ramesses III Temple",
    "Description": "Around 1150 BC, Pharaoh Ramses III built a great temple at Medinet Habu in Thebes (now Luxor). It was made to honor the gods and to remember him after his death. This temple is one of the best-preserved in Egypt and is covered with carvings that tell the story of his rule.The entrance has a massive gate with images of Ramses III defeating his enemies. Inside, there are large open spaces, tall columns, and colorful carvings on the walls. Many of these carvings show his great battles, especially his victory over the Sea Peoples, a mysterious group that tried to invade Egypt. These battles were important because they helped protect Egypt from danger.One special part of this temple is a small palace where Ramses III could stay. This was unusual for temples, as most were only used for worship. The temple was also a center for government work, with storehouses and offices where people managed food and supplies.Over time, while many other temples were abandoned, Medinet Habu remained in use. Even today, the carvings on its walls are still clear, showing the story of Ramses III’s battles and achievements. The temple stands as a symbol of his power, his victories, and the greatness of ancient Egypt, reminding us of a time when pharaohs ruled with strength and wisdom.",
    "PictureUrl": "Images\\AncientSiteImage\\TempleOfRamsis3.JPG",
    "VoiceUrl": "audios\\The Temple of Ramses III.mp3",
    "Adddress": "https://is.gd/RamessesIIITemple",
    "OpeningTime": "8:00 AM",
    "ClosedTime": "5:30 PM"
  },
  {
    "Name": "Luxor Temple",
    "Description": "Around 1400 BC, Pharaoh Amenhotep III began building the Temple of Luxor in Thebes (now Luxor). Later, Ramses II expanded it, making it even more impressive. This temple was not built for a specific god but was dedicated to Amun, Mut, and Khonsu, the gods of Thebes. It was an important place for religious festivals, especially the Opet Festival, which celebrated the power of the pharaoh.At the entrance, there is a huge gateway built by Ramses II, with two massive statues of himself sitting on a throne. In front of the entrance, there was once two giant obelisks, but today, only one remains (the other is in Paris). Inside, the temple has a long avenue lined with sphinx statues, leading to large open courtyards and tall columns decorated with colorful carvings.One of the most special things about the temple is that it was used for over 3,000 years. During Roman times, it became a military camp. Later, part of it was turned into a mosque, which still stands today.Even now, the Temple of Luxor is an incredible symbol of Egypt’s history. At night, lights make the temple glow, showing its beauty just as it might have looked in ancient times.",
    "PictureUrl": "Images\\AncientSiteImage\\TempleOfLuxor.jpg",
    "VoiceUrl": "audios\\Temple of Luxor.mp3",
    "Adddress": "https://is.gd/LuxorTemple",
    "OpeningTime": "6:00 AM",
    "ClosedTime": "10:00 PM"
  },
  {
    "Name": "Dendera Temple of Hathor",
    "Description": "The Temple of Hathor in Dendera, near Qena, is one of the best-preserved temples in Egypt. It was built during the Ptolemaic period and later completed by Roman emperors. The temple was dedicated to Hathor, the goddess of love, beauty, music, and motherhood.The temple is known for its huge stone columns with Hathor’s face, showing her with cow’s ears, a sign of her divine power. The ceiling is decorated with colorful paintings of the zodiac, stars, and the sky goddess Nut, who swallows the sun at night and gives birth to it in the morning.Inside, the sanctuary once held a golden statue of Hathor, where priests worshiped her. The temple also has a crypt, hidden underground passages, and an open rooftop, where priests studied the stars.One of its most famous carvings is the Dendera Zodiac, showing the twelve zodiac signs, now in the Louvre Museum in Paris. Another important relief shows Cleopatra VII with her son Caesarion, offering gifts to the gods.The temple was a key place for religious festivals, especially the New Year celebrations, where Hathor’s statue was carried in a grand ceremony. Today, the Temple of Hathor remains an incredible example of Egypt’s religious and artistic history.",
    "PictureUrl": "Images\\AncientSiteImage\\Hathor.jpg",
    "VoiceUrl": "audios\\Temple of Hathor.mp3",
    "Adddress": "https://is.gd/DenderaTempleOfHathor",
    "OpeningTime": "7:00 AM",
    "ClosedTime": "5:00 PM"
  }
]
