[
  {
    "Name": "The Rise and Fall of Ancient Egypt",
    "Author": "Toby Wilkinson",
    "BookPictureUrl": "Images\\BookImage\\TheRiseAndFallOfAncientEgypt.jpg",
    "Discription": "In this landmark volume, one of the world’s most renowned Egyptologists tells the epic story of this great civilization, from its birth as the first nation-state to its absorption into the Roman Empire. Drawing upon forty years of archaeological research, award-winning scholar Toby Wilkinson takes us inside a tribal society with a pre-monetary economy and decadent, divine kings who ruled with all-too-recognizable human emotions. Here are the legendary leaders: Akhenaten, the “heretic king,” who with his wife Nefertiti brought about a revolution with a bold new religion; Tutankhamun, whose dazzling tomb would remain hidden for three millennia; and eleven pharaohs called Ramesses, the last of whom presided over the militarism, lawlessness, and corruption that caused a political and societal decline. Filled with new information and unique interpretations, The Rise and Fall of Ancient Egypt is a riveting and revelatory work of wild drama, bold spectacle, unforgettable characters, and sweeping history.",
    "BookURL": "https://is.gd/TheRiseandFallOfAncientEgypt"
  },
  {
    "Name": "The Oxford History of Ancient Egypt",
    "Author": "Ian Shaw",
    "BookPictureUrl": "Images\\BookImage\\TheOxfordHistoryOfAncientEgypt.jpg",
    "Discription": "Blending vividly written essays and over a hundred attractive illustrations--including 32 color plates--The Oxford History of Ancient Egypt is a stunningly designed and authoritative account of the once glorious civilization on the Nile. Ranging from 700,000 BC to 311 AD, this volume portrays the emergence and development of Egypt from its prehistoric roots to its conquest by the Roman Empire.",
    "BookURL": "https://is.gd/TheOxfordHistoryOfAncientEgypt"
  },
  {
    "Name": "Cleopatra: A Life",
    "Author": "Stacy Schiff",
    "BookPictureUrl": "Images\\BookImage\\CleopatraALife.jpg",
    "Discription": "Cleopatra: A Life is a biography of Cleopatra, the last queen of Egypt, who ruled from 51 to 30 BC. The book aims to separate fact from fiction and shed light on the woman behind the myths and legends that have surrounded her for centuries",
    "BookURL": "https://is.gd/CleopatraALife"
  },
  {
    "Name": "The Egyptian",
    "Author": "Mika Waltari",
    "BookPictureUrl": "Images\\BookImage\\TheEgyptian.jpg",
    "Discription": "The Egyptian is a historical novel by Mika Waltari. It was first published in Finnish in 1945, and in an abridged English translation by Naomi Walford in 1949, from Swedish rather than Finnish.",
    "BookURL": "https://is.gd/TheEgyptian"
  },
  {
    "Name": "The Egyptian Book of the Dead",
    "Author": "Dr Ogden Goelet",
    "BookPictureUrl": "Images\\BookImage\\TheEgyptianBookoftheDead.jpg",
    "Discription": "The Book of the Dead is the name given to an ancient Egyptian funerary text generally written on papyrus and used from the beginning of the New Kingdom (around 1550 BC) to around 50 BC.",
    "BookURL": "https://is.gd/BookOfTheDead"
  },
  {
    "Name": "A History of Ancient Egypt: From the First Farmers to the Great Pyramid",
    "Author": "John Romer",
    "BookPictureUrl": "Images\\BookImage\\AHistoryofAncientEgypt..jpg",
    "Discription": "This extraordinary book draws on a lifetime of research and thought to recreate the previously untold story of how a civilization which began with handfuls of semi-itinerant fishermen settled, spread and created a rich, vivid, strange civilization that had its first culmination in the pharaoh Khufu building the Great Pyramid, perhaps the most astounding of all human-made landmarks. The book immerses the reader in the fascinating world of archaeological evidence, the process over the past two centuries by which this long vanished world has gradually re-emerged and the rapidly changing interpretations which these breathtaking but entirely enigmatic remains have been subjected to. Whether he is writing about the smallest necklace bead or the most elaborate royal tomb, John Romer conveys to the reader a remarkable sense of how to understand a people so like ourselves and yet in so many ways eerily different.",
    "BookURL": "https://is.gd/AHistoryofAncientEgypt1"
  },
  {
    "Name": "Red Land, Black Land: Daily Life in Ancient Egypt",
    "Author": "Barbara Mertz",
    "BookPictureUrl": "Images\\BookImage\\DailyKifeInAncientEgypt.jpg",
    "Discription": "A fascinating, erudite, and witty glimpse of the human side of ancient Egypt—this acclaimed classic work is now revised and updated for a new generation. Displaying the unparalleled descriptive power, unerring eye for fascinating detail, keen insight, and trenchant wit that have made the novels she writes (as Elizabeth Peters and Barbara Michaels) perennial New York Times bestsellers, internationally renowned Egyptologist Barbara Mertz brings a long-buried civilization to vivid life. In Red Land, Black Land, she transports us back thousands of years and immerses us in the sights, aromas, and sounds of day-to-day living in the legendary desert realm that was ancient Egypt.",
    "BookURL": "https://is.gd/RedLandBlackLand"
  },
  {
    "Name": "The Heretic Queen",
    "Author": "Michelle Moran",
    "BookPictureUrl": "Images\\BookImage\\TheHereticQueen.jpg",
    "Discription": "When Nefertari's entire family is killed in a fire, she's left to grow up alone, a spare princess in the palace of the new Pharaoh. Her young life is overshadowed by the past - the name of her infamous aunt, Nefertiti, the Heretic Queen, still strikes terror into the hearts of Egyptians. So, when she finds herself falling in love with the young Pharaoh, Ramesses, she knows it's not going to be easy to win his heart. But when the Pharaoh's aunt takes Nefertari under her wing and begins to educate her in the ways to gain a man's attention - and hold it - marriage to him seems within her reach. Yet, even as Ramesses declares his love for her, she knows there's more work to be done. If she's to be queen, all of Egypt must recognise her worth and overcome her connection to the dark, heretical days of the past.",
    "BookURL": "https://is.gd/TheHereticQueen"
  },
  {
    "Name": "When Women Ruled the World: Six Queens of Egypt",
    "Author": "Kara Cooney",
    "BookPictureUrl": "Images\\BookImage\\WhenWomenRuledtheWorld.jpg",
    "Discription": "This riveting narrative explores the lives of six remarkable female pharaohs, from Hatshepsut to Cleopatra--women who ruled with real power--and shines a piercing light on our own perceptions of women in power today.Female rulers are a rare phenomenon--but thousands of years ago in ancient Egypt, women reigned supreme. Regularly, repeatedly, and with impunity, queens like Hatshepsut, Nefertiti, and Cleopatra controlled the totalitarian state as power-brokers and rulers. But throughout human history, women in positions of power were more often used as political pawns in a male-dominated society. What was so special about ancient Egypt that provided women this kind of access to the highest political office? What was it about these women that allowed them to transcend patriarchal obstacles? What did Egypt gain from its liberal reliance on female leadership, and could today's world learn from its example? ",
    "BookURL": "https://is.gd/WhenWomenRuledtheWorld"
  },
  {
    "Name": "Cleopatra's Daughter",
    "Author": "Michelle Moran",
    "BookPictureUrl": "Images\\BookImage\\Cleopatra'sDaughter.jpg",
    "Discription": "At the dawn of the Roman Empire, when tyranny ruled, a daughter of Egypt and a son of Rome found each other. Selene's legendary parents are gone. Her country taken, she has been brought to the city of Rome in chains, with only her twin brother, Alexander, to remind her of home and all she once had.Living under the watchful eyes of the ruling family, Selene and her brother must quickly learn how to be Roman - and how to be useful to Caesar. She puts her artistry to work, in the hope of staying alive and being allowed to return to Egypt. Before long, however, she is distracted by the young and handsome heir to the empire...",
    "BookURL": "https://is.gd/CleopatrasDaughter"
  },
  {
    "Name": "Nefertiti",
    "Author": "Michelle Moran",
    "BookPictureUrl": "Images\\BookImage\\Nefertiti.jpg",
    "Discription": "Nefertiti is one of the world's great legendary beauties. Seen through her sister's eyes, she is vividly brought to life in this heartbreaking story of celebrity, ambition, love and loss. At the tender age of fifteen, Nefertiti marries Akenathen, the Prince of Egypt, her dreams coming true as she rises to fame and fortune. Bathed and decorated by a team of body servants her natural beauty is enhanced until she becomes mesmerizing. She is soon the darling of the people and her husband's closest confidant.But when her husband breaks with a thousand years of tradition, defying the priests and the military, it will take all Nefertiti's wiles to keep the nation from being torn apart. She's prepared to sacrifice her sister to strengthen her power and this act will lock the two women in a feud that only death can break...",
    "BookURL": "https://is.gd/Nefertiti"
  },
  {
    "Name": "The Memoirs of Cleopatra",
    "Author": "Margaret George",
    "BookPictureUrl": "Images\\BookImage\\TheMemoirsofCleopatra.jpg",
    "Discription": "The Memoirs of Cleopatra is a 1997 historical fiction novel written by American author Margaret George, detailing the purported life of Cleopatra VII, Queen of Egypt. Published on April 15, 1997, it landed on The New York Times Best Seller list for Fiction Hardcover. In 1999, the American network ABC adapted it for television, and released it as a four-part mini series entitled Cleopatra starring the French-Chilean actress Leonor Varela alongside Timothy Dalton and Billy Zane.",
    "BookURL": "https://is.gd/TheMemoirsofCleopatra"
  },
  {
    "Name": "Book of the Dead:Deluxe Slipcase Edition",
    "Author": "EA Wallis Budge",
    "BookPictureUrl": "Images\\BookImage\\TheEgyptianBookoftheDead2.jpg",
    "Discription": "The Book of the Dead is the name given to an ancient Egyptian funerary text generally written on papyrus and used from the beginning of the New Kingdom (around 1550 BC) to around 50 BC",
    "BookURL": "https://is.gd/DeluxeSlipcaseEdition"
  },
  {
    "Name": "Temples, Tombs, and Hieroglyphs: A Popular History of Ancient Egypt",
    "Author": "Barbara Mertz",
    "BookPictureUrl": "Images\\BookImage\\TemplesTombsAndHieroglyphs.jpg",
    "Discription": "World-renowned Egyptologist Barbara Mertz explores the reality behind the bestselling fiction she writes (as Elizabeth Peters) and casts a dazzling light on a remarkable civilization.Afascinating chronicle of an extraordinary people—from the first Stone Age settlements through the reign of Cleopatra and the Roman invasions—Temples, Tombs, and Hieroglyphs brings ancient Egypt to life as never before. Lavishly illustrated with pictures, maps, and photographs, it offers tantalizing glimpses into Egyptian society; amazing stories of the pharaohs and the rise and fall of great dynasties; a sampling of culture, religion, and folklore; stories of explorers, scientists, and scoundrels who sought to unravel or exploit the ageless mysteries; and new insights into the architectural wonders that were raised along the banks of the Nile.",
    "BookURL": "https://is.gd/TemplesTombs"
  },
  {
    "Name": "Complete Gods and Goddesses of Ancient Egypt",
    "Author": "Richard H. Wilkinson",
    "BookPictureUrl": "Images\\BookImage\\CompleteGodsAndGoddessesOfAncientEgypt.jpg",
    "Discription": "A comprehensive guide to the deities of ancient Egypt: their origins and their central role in the lives of the Egyptian people Worshipped for over three-fifths of recorded history, Egypt’s gods and goddesses are among the most fascinating of human civilization. The lives of pharaohs and commoners alike were dominated by the need to honor, worship, and pacify the huge pantheon of deities, from the benevolent to the malevolent. The richness and complexity of their mythology is reflected in countless tributes throughout Egypt, from lavish tomb paintings and imposing temple reliefs to humble household shrines.This book examines the evolution, worship, and eventual decline of the numerous gods and goddesses—from minor household figures such as Bes and Tawaret to the all-powerful deities Amun and Re—that made Egypt the most theocratic society of the ancient world, and made Egyptians, according to Herodotus, “more religious than any other people.”",
    "BookURL": "https://is.gd/CompleteGodsAndGoddesses"
  },
  {
    "Name": "The Woman Who Would Be King: Hatshepsut's Rise to Power in Ancient Egypt",
    "Author": "Kara Cooney",
    "BookPictureUrl": "Images\\BookImage\\TheWomanWhoWouldBeKing.jpg",
    "Discription": "An engrossing biography of the longest-reigning female pharaoh in Ancient Egypt and the story of her audacious rise to power.Hatshepsut—the daughter of a general who usurped Egypt's throne—was expected to bear the sons who would legitimize the reign of her father’s family. Her failure to produce a male heir, however, paved the way for her improbable rule as a cross-dressing king. At just over twenty, Hatshepsut out-maneuvered the mother of Thutmose III, the infant king, for a seat on the throne, and ascended to the rank of pharaoh.Shrewdly operating the levers of power to emerge as Egypt's second female pharaoh, Hatshepsut was a master strategist, cloaking her political power plays in the veil of piety and sexual reinvention. She successfully negotiated a path from the royal nursery to the very pinnacle of authority, and her reign saw one of Ancient Egypt’s most prolific building periods.",
    "BookURL": "https://is.gd/TheWomanWhoWouldBeKing"
  },
  {
    "Name": "Handbook of Egyptian Mythology",
    "Author": "Geraldine Harris",
    "BookPictureUrl": "Images\\BookImage\\HandbookofEgyptianMythology.jpg",
    "Discription": "In this comprehensive introduction to Egyptian mythology, author Geraldine Pinch shows how the mythology of Ancient Egypt must be pieced together from a variety of written and visual sources. Relationships between deities changed, and the Egyptian myths were never gathered by priests into an authorized version.Handbook of Egyptian Mythology provides a brief discussion about the nature of myths; the concept of time in Egyptian mythology; a historical overview of the sources of Egyptian myth; and a dictionary of deities, themes, and concepts, which concentrates on the prominent gods and goddesses in Egyptian myth. The book also includes references to general works on Egyptian culture, religion, and myth; translations of ancient texts; and a selection of literature influenced by Egyptian myth.",
    "BookURL": "https://is.gd/HandbookOfEgyptianMythology"
  },
  {
    "Name": "Egyptian Art in the Age of the Pyramids",
    "Author": "The Metropolitan Museum of Art",
    "BookPictureUrl": "Images\\BookImage\\ArtInAgeOfPyramids.jpg",
    "Discription": "International experts examine the history of the Old Kingdom, the architecture of royal pyramid complexes and nonroyal tombs, statuary, reliefs, minor arts, and the history of evacuations of Old Kingdom monuments.",
    "BookURL": "https://is.gd/EgyptianArtInAgeOfPyramid"
  },
  {
    "Name": "Akhenaten History, Fantasy And Ancient Egypt",
    "Author": "Dominic Montserrat",
    "BookPictureUrl": "Images\\BookImage\\Akhenaten.jpg",
    "Discription": "The pharaoh Akhenaten, who ruled Egypt in the mid-fourteenth century BCE, has been the subject of more speculation than any other character in Egyptian history. This provocative new biography examines both the real Akhenaten and the myths that have been created around him. It scrutinises the history of the pharaoh and his reign, which has been continually written in Eurocentric terms inapplicable to ancient Egypt, and the archaeology of Akhenaten's capital city, Amarna. It goes on to explore the pharaoh's extraordinary cultural afterlife, and the way he has been invoked to validate everything from psychoanalysis to racial equality to Fascism.",
    "BookURL": "https://is.gd/AkhenatenHistory"
  },
  {
    "Name": "Daughters of Isis : women of ancient Egypt",
    "Author": "Joyce Tyldesley",
    "BookPictureUrl": "Images\\BookImage\\DaughtersOfIsis.jpg",
    "Discription": "In ancient Egypt women enjoyed a legal, social and sexual independence unrivalled by their Greek or Roman sisters, or in fact by most women until the late nineteenth century. They could own and trade in property, work outside the home, marry foreigners and live alone without the protection of a male guardian. Some of them even rose to rule Egypt as 'female kings'. Joyce Tyldesley's vivid history of how women lived in ancient Egypt weaves a fascinating picture of daily life -- marriage and the home, work and play, grooming and religion -- viewed from a female perspective, in a work that is engaging, original and constantly surprising.",
    "BookURL": "https://is.gd/DaughtersOfIsis"
  }
]
