[
  {
    "Name": "The Great Life Of Ramses",
    "DocPictureUrl": "Images\\DocumetriesImage\\TheGreatLifeOfRamses.jpg",
    "DocumentryUrl": "https://is.gd/GreateLifeOfRamsis",
    "Discription": "A new 4 hour documentary film telling the entire life & death of Pharaoh Ramses The Second like never before! A Film by Curtis Ryan Woodside Chief Consultant Dr Zahi Hawass",
    "ContentCreator": "Curtis Ryan Woodside & Chief Consultant Dr Zahi Hawass"
  },
  {
    "Name": "Secrets Of Giza",
    "DocPictureUrl": "Images\\DocumetriesImage\\SecretsOfGiza.jpg",
    "DocumentryUrl": "https://is.gd/SecretsOfGiza",
    "Discription": "Zahi Hawass & Curtis Ryan Woodside explore the secrets of the pyramids! The pyramids of Giza have faced endless scrutiny, and raised thousands of questions, who's face is on the sphinx, who built the pyramids, and what was their purpose? We explore the entire surface of the Giza Plateau to discover the intriguing 4th dynasty family, the workers and the pharaohs! From the over looked tombs deep below ground, to spectacular treasures from 4500 years ago. Come with to discover the secrets of Giza.",
    "ContentCreator": "Curtis Ryan Woodside & Chief Consultant Dr Zahi Hawass"
  },
  {
    "Name": "The Egyptian Cat Goddess",
    "DocPictureUrl": "Images\\DocumetriesImage\\Cat Goddess.jpg",
    "DocumentryUrl": "https://is.gd/TheEgyptianCatGoddess",
    "Discription": "Explore the ancient forgotten city of the cat, high up in the nile delta, Bubastis. A city that was written about by many ancient historians as a feminine stronghold and even mentioned in the bible as the a site where Jesus lived. Search for the facts on cat worship in ancient Egypt, from the tombs, and scattered treasures all around the world. Hear first hand from cat mummy expert Salima Ikram what was really going on with cat priests! Come with Curtis Ryan Woodside, in the search for the ancient cat goddess. ",
    "ContentCreator": "Curtis Ryan Woodside & Dr Salima Ikram"
  },
  {
    "Name": "CLEOPATRA: The Story of the Queen of Egypt",
    "DocPictureUrl": "Images\\DocumetriesImage\\CLEOPATRA.jpg",
    "DocumentryUrl": "https://is.gd/CLEOPATRA",
    "Discription": "Discover the true Cleopatra: A 90 minute documentary With Zahi Hawass, Kathleen Martinez and more...A Documentary by Curtis Ryan Woodside, Co-Produced by Sofia Aziz. Discover the REAL Cleopatra...A figure whose name and legacy is burned into the minds of billions. Coming from a tenacious Greek Macedonian family, she had to fight and even kill for her place on the throne, a noble attempt to save a failing Egypt. She left her mark during the final days of ancient egypt. Her story has been warped so much through out history, from biast opinions to praise, yet who was she really? Everyone thinks they know her, everyone has a different opinion, but most of those are modern, based on films and misinformed play-writes. How much do we really know about the true… Cleopatra. ",
    "ContentCreator": "Curtis Ryan Woodside"
  },
  {
    "Name": "Ancient Egypt’s Female Pharaoh: Sobekneferu The Crocodile Princess",
    "DocPictureUrl": "Images\\DocumetriesImage\\Sobekneferu.jpg",
    "DocumentryUrl": "https://is.gd/TheCrocodilePrincess",
    "Discription": "Ancient Egypt's first recorded female pharaoh, Sobekneferu. Discover how she became a ruler in a mans world, her life in on of the most troubled times in ancient history and her mysterious death and burial pyramid..., With Dr Colleen Darnell, Dr Zahi Hawass, Sofia Aziz, Dr Sahar Saleem, Kayleigh During, Auset Rohn & Roann Hills.",
    "ContentCreator": "Curtis Ryan Woodside"
  },
  {
    "Name": "Discover Egypt And Nubia! Sailing Lake Nasser",
    "DocPictureUrl": "Images\\DocumetriesImage\\EgyptAndNubia.jpg",
    "DocumentryUrl": "https://is.gd/EgyptAndNubia",
    "Discription": "A new two hour documentary where we sail down the length of Lake Nasser, exploring every site along the way on this forgotten area of the Nile in Egypt. Discover the wonders of ancient Egypt and ancient Nubia as we sail from Aswan to Abu Simbel before reaching the Sudan border. ",
    "ContentCreator": "Curtis Ryan Woodside"
  },
  {
    "Name": "Egyptian Secrets Of Siwa Ancient Oasis Of The Oracle: SIWA",
    "DocPictureUrl": "Images\\DocumetriesImage\\Siwa.jpg",
    "DocumentryUrl": "https://is.gd/SecretsOfSiwa",
    "Discription": "Discover the secrets of Siwa, the history, mysteries, tombs, temples and beauty of the Ancient Egyptian Oasis.",
    "ContentCreator": "Curtis Ryan Woodside"
  },
  {
    "Name": "Egypt Vs Nubia: Queen Amenirdis The 25th Dynasty!",
    "DocPictureUrl": "Images\\DocumetriesImage\\Amenirdis.jpg",
    "DocumentryUrl": "https://is.gd/Amenirdis",
    "Discription": "A young Nubian princess is adopted by an Egyptian priestess, and thus allowing the 25th Dynasty (Nubian Dynasty) of ancient Egypt to commence. Come with Curtis Ryan Woodside, Dr Brittany Brown & Amy Auset Rohn to discover who Amenirdis was, her role as the gods wife and the intriguing events of the time when Nubian ruled Egypt. ",
    "ContentCreator": "Curtis Ryan Woodside"
  },
  {
    "Name": "Alexander the Great Pharaoh The Untold Story Of Alexander the Great In Egypt!",
    "DocPictureUrl": "Images\\DocumetriesImage\\Alexander.jpg",
    "DocumentryUrl": "https://is.gd/AlexanderTheGreat",
    "Discription": "Discover what Alexander The Great really did in Egypt! Alexander the Great, his reputation is known all around the world. Of Macedonian greek royalty, he was trained to not only be wise, but to be one of the worlds greatest conquerers. His wars against the Persians are legendary… he was even crowned a pharaoh of Egypt! But why was this foreign man welcomed into Egypt? Was there something more to his presence here? Or was it because of the close ties between Egypt and Greece. A Film by Curtis Ryan Woodside With Sofia Aziz & Lamey Drwish",
    "ContentCreator": "Curtis Ryan Woodside"
  },
  {
    "Name": "Egyptian Secrets At The Vatican",
    "DocPictureUrl": "Images\\DocumetriesImage\\Vatican.jpg",
    "DocumentryUrl": "https://is.gd/SecretsAtVatican",
    "Discription": "A place that contains secrets from the ancient world. With sacred writing inscribed long before Rome had it's emperors, take a closer look at the Egyptian treasures collected by the Catholic Church and Popes at the Vatican. ",
    "ContentCreator": "Curtis Ryan Woodside"
  },
  {
    "Name": "Nefertiti's Daughters & Tutankhamun’s Sisters",
    "DocPictureUrl": "Images\\DocumetriesImage\\Nefertiti's Daughters.jpg",
    "DocumentryUrl": "https://is.gd/NefertitisDaughters",
    "Discription": "Discover the lives of all 6 children that Queen Nefertiti was mother to, and the fate of the sisters of Tutankamun",
    "ContentCreator": "Curtis Ryan Woodside"
  },
  {
    "Name": "NEFERTARI: The Secrets Of An Egyptian Queen",
    "DocPictureUrl": "Images\\DocumetriesImage\\NEFERTARI.jpg",
    "DocumentryUrl": "https://is.gd/NEFERTARI",
    "Discription": "One of Ancient Egypt’s most renowned royal women, but is almost unknown by non-egyptologists. She was known as the most beautiful, and intelligent queens in the ancient world. Her husband built a temple for her, she may have even been the power behind the Pharaoh… her name was Nefertari - The Beauty Of the Beauties. But who was this mysterious woman? We don’t know much about her, but through years of research, and putting together various sources of information, we can now possibly tell a more complete story of her life.",
    "ContentCreator": "Curtis Ryan Woodside"
  },
  {
    "Name": "Egypts Ancient Oasis: Wonders of Fayum",
    "DocPictureUrl": "Images\\DocumetriesImage\\Ancient Oasis.jpg",
    "DocumentryUrl": "https://is.gd/EgyptsAncientOasis",
    "Discription": "Far out in the middle of the deserts of Egypt emerges a paradise, the oasis of Fayoum. For thousands of years this unique landscape has hosted farmers, potters, nomads and Pharaohs. We set out deep into the desert to discover the off the beaten track, exploring 4000 year old temples, protected by ferocious beasts, with mysterious underground chambers, we see the burials of the men and women who lived in the oasis, where they exported wine across their known world, visit a valley that was once ocean floor millions of years ago, and see an ancient way of life unchanged for millennia. We have the adventure of a lifetime, in one of the most magical and beautiful places in all of Egypt, come with to discover the wonders of Fayoum. ",
    "ContentCreator": "Curtis Ryan Woodside"
  },
  {
    "Name": "Mummy Of Nefertiti Discovered?",
    "DocPictureUrl": "Images\\DocumetriesImage\\Mummy Of Nefertiti.jpg",
    "DocumentryUrl": "https://is.gd/MummyOfNefertiti",
    "Discription": "New evidence on the mummy of Queen Nefertiti! Join Curtis Ryan Woodside, Kara Cooney, Bob Bianchi, Sofia Aziz, Aidan Dodson, Paul Harrison and John J Johnston as we explore the various theories about Nefertiti's mummy and tomb, as well as discovering new evidence in the search for the mysterious Egyptian Queen.",
    "ContentCreator": "Curtis Ryan Woodside"
  },
  {
    "Name": "Tutankhamun’s Great Grandparents: TUYA & YUYA",
    "DocPictureUrl": "Images\\DocumetriesImage\\Tutankhamun’s Great Grandparents.jpg",
    "DocumentryUrl": "https://is.gd/TutankhamunsGrandPartents",
    "Discription": "Before the discovery of King Tut's tomb, there was Tuya and Yuya, but why were these non-royals buried in the valley of the kings in Egypt? We uncover the secrets of Ancient Egypt's most famous pharaoh Tutankhamun's great grandparents.A Film by Curtis Ryan Woodside With Sofia Aziz",
    "ContentCreator": "Curtis Ryan Woodside"
  },
  {
    "Name": "The Daughters Of Tutankhamun",
    "DocPictureUrl": "Images\\DocumetriesImage\\Daughters Of Tutankhamun.jpg",
    "DocumentryUrl": "https://is.gd/DaughtersOfTutankhamun",
    "Discription": "Dr Sahar Saleem reveals her CT scans of the tragic children King Tut in-depth with unprecedented techniques to discover their secrets and using these new techniques, we can unveil the faces of Tutankhamun’s children, for the first time! Tut and his wife Ankhesenamun had a deep love, evident from the images we see of them together. They tried to continue their family line, resulting in the divesting outcome of 2 still born children. But what about these 2 children of Tut and Ankhe, we investigate. A Film by Curtis Ryan Woodside",
    "ContentCreator": "Curtis Ryan Woodside"
  },
  {
    "Name": "Ancient Egyptian Family Feud Female Pharaoh Vs. Stepson",
    "DocPictureUrl": "Images\\DocumetriesImage\\Ancient Egyptian Family Feud.jpg",
    "DocumentryUrl": "https://is.gd/AncientEgyptianFamilyFeud",
    "Discription": "How did a female pharaoh and a young king bring about the final days of the Ramesside family? We investigate the end of Egypts largest family and how the legacy of Ramses the great came to an abrupt end.A Film by Curtis Ryan Woodside",
    "ContentCreator": "Curtis Ryan Woodside"
  },
  {
    "Name": "Forgotten Treasures of EGYPT",
    "DocPictureUrl": "Images\\DocumetriesImage\\Forgotten Treasures of EGYPT.jpg",
    "DocumentryUrl": "https://is.gd/ForgottenTreasuresOfEGYPT",
    "Discription": "We investigate a mysterious pharaoh, the evolution of death, enemies, queens and forgotten treasures in the centre of Italy all in the city that brought the men who discovered Tutankhamun together.A Film by Curtis Ryan Woodside",
    "ContentCreator": "Curtis Ryan Woodside"
  },
  {
    "Name": "Stolen From Egypt Neues Museum Berlin",
    "DocPictureUrl": "Images\\DocumetriesImage\\Stolen From Egypt.jpg",
    "DocumentryUrl": "https://is.gd/StolenFromEgypt",
    "Discription": "From the famous Nefertiti to Queen Tiye, the glory of ancient Egypt has been scattered across the world. Now let us take a look at the ancient Egyptian treasures housed in the Neues Museum Berlin, filled with spoils of war. Artifacts that have caused much controversy for many years! It was not too long ago that these pieces faced near annihilation. A Film by Curtis Ryan Woodside",
    "ContentCreator": "Curtis Ryan Woodside"
  },
  {
    "Name": "Ancient Egyptian Secrets At The Monastery Catholic Church Treasure Collection!",
    "DocPictureUrl": "Images\\DocumetriesImage\\Ancient Egyptian Secrets At The Monastery.jpg",
    "DocumentryUrl": "https://is.gd/AncientEgyptianSecrets",
    "Discription": "Ancient Egyptian artefacts hidden high away in a monastery in the Tuscan hills of Italy. From mummies, sacred texts, links to the crusades and more in this exclusive access of a private collection of Ancient Egyptian artifacts collected by the Catholic Church! A Film by Curtis Ryan Woodside",
    "ContentCreator": "Curtis Ryan Woodside"
  },
  {
    "Name": "Did Ancient Egyptians Live At Pompeii? Egyptian Secrets At Pompeii",
    "DocPictureUrl": "Images\\DocumetriesImage\\Did Ancient Egyptians Live At Pompeii.jpg",
    "DocumentryUrl": "https://is.gd/AncientEgyptionsInPompei",
    "Discription": "Discover the history & treasures of ancient Egyptians who lived in Pompeii in the shadow of mount Vesuvius. A Film by Curtis Ryan Woodside",
    "ContentCreator": "Curtis Ryan Woodside"
  },
  {
    "Name": "Expedition Egypt",
    "DocPictureUrl": "Images\\DocumetriesImage\\Expedition Egypt.jpg",
    "DocumentryUrl": "https://is.gd/ExpeditionEgypt",
    "Discription": "A New 100 Minute Documentary Exploring an unexcavated tomb in Saqqara, some of Egypts most famous sites, making new discoveries, perils inside pyramids, deep inside Abu Simbel, Valley Of the Kings & Queens & taking you to some places never before filmed. Explore the history with us! Hosted by Curtis Ryan Woodside & Egyptologist Sharon Hague. Following the maiden expedition across the land of the Pharaohs for Ancient Destinations Tours.",
    "ContentCreator": "Curtis Ryan Woodside"
  },
  {
    "Name": "DISCOVER EGYPT",
    "DocPictureUrl": "Images\\DocumetriesImage\\DISCOVER EGYPT.jpg",
    "DocumentryUrl": "https://is.gd/DISCOVEREGYPT",
    "Discription": "With its history spanning over 5000 years...Travel the length of Egypt, and discover the famous faces of the Pharaohs and Queens, and the faces of those less well know.A Documentary by Curtis Ryan Woodside.A different side of the ancient Egyptian history, showing you places most people have never seen or heard about. Including the tomb that should have been for Tutankhamun, The Great Queen of Ramses II - Nefertari - and much more.Come see Egypt with unlimited access.",
    "ContentCreator": "Curtis Ryan Woodside"
  },
  {
    "Name": "Egypt Through The Ages ",
    "DocPictureUrl": "Images\\DocumetriesImage\\Egypt Through The Ages.jpg",
    "DocumentryUrl": "https://is.gd/EgyptThroughTheAges",
    "Discription": "An Amazon Prime Original documentary series release, NOW enjoy the full film version as we explore a land filled with mystery, wonder and beauty. From Temples, Pharaohs, Queens and tombs filled with gold. With special access to tombs, monuments and artifacts rarely seen before. From the Monuments of Ramses II, to the golden treasures of Tutankhamun, and the lesser-known stories of this epic country. A Documentary by Curtis Ryan Woodside.COME DISCOVER THE HISTORY OF EGYPT THROUGH THE AGES! ",
    "ContentCreator": "Curtis Ryan Woodside"
  },
  {
    "Name": "3100 BC: Unearthing The Origins of Ancient Egypt",
    "DocPictureUrl": "Images\\DocumetriesImage\\The Origins of Ancient Egypt.jpg",
    "DocumentryUrl": "https://is.gd/TheOriginsOfAncientEgypt",
    "Discription": "In the first episode, Professor Joann Fletcher goes in search of the building blocks of Egyptian civilisation and finds out what made ancient Egypt the incredible civilisation that it was.Joann sees how people here changed, in just a few centuries, from primitive farmers to pyramid builders and finds the early evidence for Egypt's amazing gods and obsession with death and the afterlife.On her search, Joann travels almost 20,000 years back in time to discover north Africa's earliest rock art, she discovers how the first writing was used to calculate taxes and explores one of the first stone structures on earth - Egypt's first pyramid. Joann ends her journey in the largest monument of them all - the Great Pyramid. Here, she explains how Egypt had now reached a pinnacle - the ultimate society, creating one of the wonders of the ancient world.",
    "ContentCreator": "Timeline"
  },
  {
    "Name": "What Caused The End Of The Pyramid Age?",
    "DocPictureUrl": "Images\\DocumetriesImage\\What Caused The End Of The Pyramid Age.jpg",
    "DocumentryUrl": "https://is.gd/WhatCauseTheEndOfThePyramids",
    "Discription": "The professor explores one of Saqqara's last pyramid complexes to illustrate how Ancient Egypt's `Pyramid Age' came to an end. A worsening climate combined with political upheaval, famine and economic difficulties to plunge the state into a dark era of civil war, with the land dividing into smaller city-states headed by ambitious small-town leaders. In an obscure tomb in Thebes, she uncovers the stories of warriors who fought in the bloody battle that would eventually lead to Egypt's reunification, and reveals how settlers known as the `Hyksos' tried to infiltrate the fledgling nation's government to seize the throne.",
    "ContentCreator": "Timeline - World History Documentaries"
  },
  {
    "Name": "Amenhotep III: Was This Man Egypt's Greatest Pharaoh?",
    "DocPictureUrl": "Images\\DocumetriesImage\\Amenhotep.jpg",
    "DocumentryUrl": "https://is.gd/Amenhotep",
    "Discription": "Joann explores the peak of ancient Egyptian civilisation by looking at the Colossi of Memnon, two massive stone statues depicting Pharaoh Amenhotep III, and examining the lives of the workers and artisans involved in the building of the Valley of the Kings. This golden age was threatened by the growing power of Karnak's priests, and Joann reveals how Tutankhamen's early death was a chance for Egypt to start afresh and rewrite history, but was undermined by decades of state-sanctioned looting of the tombs.",
    "ContentCreator": "Timeline"
  },
  {
    "Name": "Why Did Ancient Egypt Eventually Fall?",
    "DocPictureUrl": "Images\\DocumetriesImage\\Why Did Ancient Egypt Eventually Fall.jpg",
    "DocumentryUrl": "https://is.gd/AncientEgyptEventuallyFall",
    "Discription": "The historian reveals how Egypt's enemies exploited a country weakened by internal strife, travelling south to Sudan to examine the story of the forgotten Nubian kings, who ruled Egypt from their southern homeland for a century, even building their own pyramids to bury their monarchs. She then explores how the next group of invaders the Saites took the tradition of mummification to new extremes by preserving millions of animals, before Alexander the Great came to Egypt's rescue and founded the greatest city on Earth.",
    "ContentCreator": "Timeline"
  },
  {
    "Name": "The Story Of Ancient Egypt's Mysterious Queens",
    "DocPictureUrl": "Images\\DocumetriesImage\\Lost Queens.jpg",
    "DocumentryUrl": "https://is.gd/LostQueens",
    "Discription": "Historian, Joann Fletcher explores the hitherto downplayed role that women took in the running of state and, indeed, in shaping every aspect of life in Ancient Egypt. Perhaps unassumed by most, the ancient Egyptians were unique in their attitude to sexual equality with women holding the title of ‘Pharaoh’ no fewer than 18 times, while there were also female doctors, tutors, prime ministers and priestesses. Focusing on women of royalty such as Pharaoh Hatshepsut and Queen Nefertari, as well as women of high profession such as Lady Peseshet, the earliest female doctor known to the world, Fletcher reveals an ancient civilization unparalleled in its sexual equality.",
    "ContentCreator": "Timeline"
  },
  {
    "Name": "Hypatia And The Great Fall Of Alexandria",
    "DocPictureUrl": "Images\\DocumetriesImage\\FallOfAlexandria.jpg",
    "DocumentryUrl": "https://is.gd/FallOfAlexandria",
    "Discription": "Once the biggest and most influential city on the planet, founded by Alexander the Great and home to Cleopatra, Archimedes and the largest library in the world. How did this shining beacon for civilisation and knowledge meet its classical demise? Featuring stunning visualisations from the major movie Agora, acclaimed historian Bettany Hughes looks at Alexandria past and present, unearthing archaeological gems and following in the footsteps of Hypatia, the city’s last great female philosopher and guardian of great Library of Alexandria - whose murder would bring down the curtain not just on an era but on the ancient world as a whole.",
    "ContentCreator": "Timeline"
  },
  {
    "Name": "Finding The Lost Tomb of Alexander the Great",
    "DocPictureUrl": "Images\\DocumetriesImage\\Lost Tomb of Alexander.jpg",
    "DocumentryUrl": "https://is.gd/LostTombOfAlexander",
    "Discription": "Archaeologist Pepi Papakosta is on a mission to find Alexander the Great’s lost tomb. Excavating in the center of Alexandria, Egypt, the city Alexander founded 2,300 years ago, she has discovered a rare marble statue of Alexander, along with Greek treasures and secret tunnels. But Pepi’s biggest find is an extraordinary discovery even she was not expecting.",
    "ContentCreator": "National Geographic"
  },
  {
    "Name": "Egypt's Ancient Empire | Egypt From Above The Nile River",
    "DocPictureUrl": "Images\\DocumetriesImage\\Egypt's Ancient Empire.jpg",
    "DocumentryUrl": "https://is.gd/EgyptsAncientEmpire",
    "Discription": "A spectacular aerial journey across Egypt reveals how the Nile River was the key to the ancients’ empire and why it is still important today.",
    "ContentCreator": "National Geographic"
  },
  {
    "Name": "Cleopatra's Lost Tomb | Lost Treasures of Egypt",
    "DocPictureUrl": "Images\\DocumetriesImage\\Cleopatra's Lost Tomb.jpg",
    "DocumentryUrl": "https://is.gd/CleopatrasLostTomb",
    "Discription": "Archaeologists hunt for the lost tomb of Cleopatra. One team dives the sunken city of Alexandria and an explorer unearths a secret underground tunnel.",
    "ContentCreator": "National Geographic"
  },
  {
    "Name": "Curse of the Mummy | Lost Treasures of Egypt",
    "DocPictureUrl": "Images\\DocumetriesImage\\Curse of the Mummy.jpg",
    "DocumentryUrl": "https://is.gd/CurseOfTheMummy",
    "Discription": "Archaeologists search Egypt’s ancient burial grounds to solve the mysteries of the most intriguing artifacts of all … mummies.",
    "ContentCreator": "National Geographic"
  },
  {
    "Name": "Tomb of Pharaoh Tutankhamun | Lost Treasures of Egypt",
    "DocPictureUrl": "Images\\DocumetriesImage\\Tomb of Pharaoh Tutankhamun.jpg",
    "DocumentryUrl": "https://is.gd/TombOfPharaohTutankhamun",
    "Discription": "Technology reveals the hidden secrets of Tutankhamun’s treasures, and a team on the search for Tutankhamun’s lost quarry makes a surprising find.",
    "ContentCreator": "National Geographic"
  },
  {
    "Name": "King Tut's Treasures: Hidden Secrets Rediscovered",
    "DocPictureUrl": "Images\\DocumetriesImage\\King Tut's Treasures.jpg",
    "DocumentryUrl": "https://is.gd/KingTutsTreasures",
    "Discription": "Many have never been seen before but together they shed new light on the short, eventful life of the so-called ‘Boy King’ and are now helping experts realise the sheer scale of Tutankhamun’s influence in the ancient world.",
    "ContentCreator": "National Geographic"
  }
  
]
